rtkconnectivity/rtl87x2g_sdk/bsp/boot/rtl87x2g/system_rtl.c
    //clear dtcm zi
#if defined (__ARMCC_VERSION)
    extern unsigned int Image$$ER_IRAM_NS$$ZI$$Base;
    extern unsigned int Image$$ER_IRAM_NS$$ZI$$Length;

    section_image_base = (unsigned int *)& Image$$ER_IRAM_NS$$ZI$$Base;
    section_image_length = (unsigned int)& Image$$ER_IRAM_NS$$ZI$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__enter_iram_ns_zi_start__;
    extern unsigned int *__enter_iram_ns_zi_length__;

    section_image_base = (unsigned int *)& __enter_iram_ns_zi_start__;
    section_image_length = (unsigned int)& __enter_iram_ns_zi_length__;
#endif
    // cppcheck-suppress nullPointer; objectIndex
    memset(section_image_base, 0, section_image_length);
#if (BOOT_DIRECT_DEBUG == 1)
    DBG_DIRECT("APP clear DTCM zi: addr 0x%x, len %d", (uint32_t)section_image_base,
               section_image_length);
#endif

    //copy data sram ro
#if defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    extern unsigned int Image$$DATA_SRAM_SECTION$$RO$$Base;
    extern unsigned int Load$$DATA_SRAM_SECTION$$RO$$Base;
    extern unsigned int Image$$DATA_SRAM_SECTION$$RO$$Length;

    section_image_base = (unsigned int *)& Image$$DATA_SRAM_SECTION$$RO$$Base;
    section_load_base = (unsigned int *)& Load$$DATA_SRAM_SECTION$$RO$$Base;
    section_image_length = (unsigned int)& Image$$DATA_SRAM_SECTION$$RO$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__data_sram_section_ro_start__;
    extern unsigned int *__data_sram_section_ro_load_ad__;
    extern unsigned int *__data_sram_section_ro_length__;

    section_image_base = (unsigned int *)& __data_sram_section_ro_start__;
    section_load_base = (unsigned int *)& __data_sram_section_ro_load_ad__;
    section_image_length = (unsigned int)& __data_sram_section_ro_length__;
#endif

    for (i = 0; i < section_image_length / sizeof(unsigned int); i ++)
    {
        //cppcheck-suppress objectIndex
        section_image_base[i] = section_load_base[i];
    }
#if (BOOT_DIRECT_DEBUG == 1)
    DBG_DIRECT("APP copy DATA SRAM RO: src 0x%x, dest 0x%x, len %d",
               (uint32_t)section_load_base, (uint32_t)section_image_base, section_image_length);
#endif

    //copy data sram rw
#if defined (__ARMCC_VERSION)
    extern unsigned int Image$$DATA_SRAM_SECTION$$RW$$Base;
    extern unsigned int Load$$DATA_SRAM_SECTION$$RW$$Base;
    extern unsigned int Image$$DATA_SRAM_SECTION$$RW$$Length;

    section_image_base = (unsigned int *)& Image$$DATA_SRAM_SECTION$$RW$$Base;
    section_load_base = (unsigned int *)& Load$$DATA_SRAM_SECTION$$RW$$Base;
    section_image_length = (unsigned int)& Image$$DATA_SRAM_SECTION$$RW$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__data_sram_section_rw_exe_ad__;
    extern unsigned int *__data_sram_section_rw_load_ad__;
    extern unsigned int *__data_sram_section_rw_length__;

    section_image_base = (unsigned int *)& __data_sram_section_rw_exe_ad__;
    section_load_base = (unsigned int *)& __data_sram_section_rw_load_ad__;
    section_image_length = (unsigned int)& __data_sram_section_rw_length__;
#endif
    // cppcheck-suppress nullPointer; objectIndex
    memcpy(section_image_base, section_load_base, section_image_length);

#if (BOOT_DIRECT_DEBUG == 1)
    DBG_DIRECT("APP copy DATA SRAM rw: src 0x%x, dest 0x%x, len %d",
               (uint32_t)section_load_base, (uint32_t)section_image_base, section_image_length);
#endif

    //clear DATA SRAM zi
#if defined (__ARMCC_VERSION)
    extern unsigned int Image$$DATA_SRAM_SECTION$$ZI$$Base;
    extern unsigned int Image$$DATA_SRAM_SECTION$$ZI$$Length;

    section_image_base = (unsigned int *)& Image$$DATA_SRAM_SECTION$$ZI$$Base;
    section_image_length = (unsigned int)& Image$$DATA_SRAM_SECTION$$ZI$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__data_sram_section_zi_start__;
    extern unsigned int *__data_sram_section_zi_length__;

    section_image_base = (unsigned int *)& __data_sram_section_zi_start__;
    section_image_length = (unsigned int)& __data_sram_section_zi_length__;
#endif
    // cppcheck-suppress nullPointer; objectIndex
    memcpy(section_image_base, section_load_base, section_image_length);
#if (BOOT_DIRECT_DEBUG == 1)
    DBG_DIRECT("APP clear DATA SRAM zi: addr 0x%x, len %d", (uint32_t)section_image_base,
               section_image_length);
#endif

#if (USE_PSRAM == 1)
    //copy psram ro
#if defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    extern unsigned int Image$$PSRAM_SECTION$$RO$$Base;
    extern unsigned int Load$$PSRAM_SECTION$$RO$$Base;
    extern unsigned int Image$$PSRAM_SECTION$$RO$$Length;
    section_image_base = (unsigned int *)& Image$$PSRAM_SECTION$$RO$$Base;
    section_load_base = (unsigned int *)& Load$$PSRAM_SECTION$$RO$$Base;
    section_image_length = (unsigned int)& Image$$PSRAM_SECTION$$RO$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__psram_section_ro_start__;
    extern unsigned int *__psram_section_ro_load_ad__;
    extern unsigned int *__psram_section_ro_length__;
    section_image_base = (unsigned int *)& __psram_section_ro_start__;
    section_load_base = (unsigned int *)& __psram_section_ro_load_ad__;
    section_image_length = (unsigned int)& __psram_section_ro_length__;
#endif
    for (i = 0; i < section_image_length / sizeof(unsigned int); i ++)
    {
        //cppcheck-suppress objectIndex
        section_image_base[i] = section_load_base[i];
    }
    DBG_DIRECT("APP copy PSRAM RO: src 0x%x, dest 0x%x, len %d",
               (uint32_t)section_load_base, (uint32_t)section_image_base, section_image_length);

    //copy PSRAM rw
#if defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    extern unsigned int Image$$PSRAM_SECTION$$RW$$Base;
    extern unsigned int Load$$PSRAM_SECTION$$RW$$Base;
    extern unsigned int Image$$PSRAM_SECTION$$RW$$Length;
    section_image_base = (unsigned int *)& Image$$PSRAM_SECTION$$RW$$Base;
    section_load_base = (unsigned int *)& Load$$PSRAM_SECTION$$RW$$Base;
    section_image_length = (unsigned int)& Image$$PSRAM_SECTION$$RW$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__psram_section_rw_exe_ad__;
    extern unsigned int *__psram_section_rw_load_ad__;
    extern unsigned int *__psram_section_rw_length__;
    section_image_base = (unsigned int *)& __psram_section_rw_exe_ad__;
    section_load_base = (unsigned int *)& __psram_section_rw_load_ad__;
    section_image_length = (unsigned int)& __psram_section_rw_length__;
#endif
    for (i = 0; i < section_image_length / sizeof(unsigned int); i ++)
    {
        //cppcheck-suppress objectIndex
        section_image_base[i] = section_load_base[i];
    }
    DBG_DIRECT("APP copy PSRAM rw: src 0x%x, dest 0x%x, len %d",
               (uint32_t)section_load_base, (uint32_t)section_image_base, section_image_length);

    //clear PSRAM zi
#if defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    extern unsigned int Image$$PSRAM_SECTION$$ZI$$Base;
    extern unsigned int Image$$PSRAM_SECTION$$ZI$$Length;
    section_image_base = (unsigned int *)& Image$$PSRAM_SECTION$$ZI$$Base;
    section_image_length = (unsigned int)& Image$$PSRAM_SECTION$$ZI$$Length;
#elif defined ( __GNUC__ )
    extern unsigned int *__psram_section_zi_start__;
    extern unsigned int *__psram_section_zi_length__;
    section_image_base = (unsigned int *)& __psram_section_zi_start__;
    section_image_length = (unsigned int)& __psram_section_zi_length__;
#endif
    for (i = 0; i < section_image_length / sizeof(unsigned int); i ++)
    {
        //cppcheck-suppress objectIndex
        section_image_base[i] = 0;
    }
    DBG_DIRECT("APP clear PSRAM zi: addr 0x%x, len %d", (uint32_t)section_image_base,
               section_image_length);
#endif
}

void wdg_system_reset_app_cb(WDTMode_TypeDef wdt_mode,
                             T_SW_RESET_REASON reset_reason) APP_FLASH_TEXT_SECTION ;
void wdg_system_reset_app_cb(WDTMode_TypeDef wdt_mode, T_SW_RESET_REASON reset_reason)
{
#if (FTL_POOL == 1)
    extern void ftl_cache_disable(void);
    ftl_cache_disable();
#endif

