rtkconnectivity/rtl87x2g_sdk/bsp/boot/rtl87x2g/system_rtl.c
    //do something necessary before watch dog reset
    if (user_wdt_cb)
    {
        if (user_wdt_cb(wdt_mode, reset_reason))
        {
            return;
        }
    }

}

void set_os_clock(OS_TICK os_tick) APP_FLASH_TEXT_SECTION;
void set_os_clock(OS_TICK os_tick)
{
    switch (os_tick)
    {
    case OS_TICK_10MS:
        OTP->os_tick_rate_HZ = 100;
        break;
    case OS_TICK_5MS:
        OTP->os_tick_rate_HZ = 200;
        break;
    case OS_TICK_2MS:
        OTP->os_tick_rate_HZ = 500;
        break;
    case OS_TICK_1MS:
        OTP->os_tick_rate_HZ = 1000;
        break;
    default:
        break;
    }
}

static void AppUpdateVectorTable(void)
{
#if defined ( __ARMCC_VERSION )
    extern uint32_t Load$$RAM_VECTOR_TABLE$$RO$$Base;
    extern uint32_t Image$$RAM_VECTOR_TABLE$$RO$$Length;
#elif defined ( __GNUC__ )
    extern uint32_t *__ram_vector_load_ad__;
    extern uint32_t *__ram_vector_exe_ad__;
    extern uint32_t *__ram_vector_table_length__;
#endif

    extern void Default_Handler(void);
    const char *SysException[] =
    {
        "InitialSP", "Reset", "NMI", "HardFault", "MemManage", "BusFault", "UsageFault", "Rsvd",
        "Rsvd", "Rsvd", "Rsvd", "SVC", "DebugMon", "Rsvd", "PendSV", "SysTick"
    };
    const char *ExtIrq[] =
    {
        "System", "WDT", "RXI300", "RXI300_SEC", "Zigbee", "BTMAC", "Peripheral", "Rsvd", "RTC",
        "GPIO_A0", "GPIO_A1", "GPIO_A_2_7", "GPIO_A_8_15", "GPIO_A_16_23", "GPIO_A_24_31",
        "GPIO_B_0_7", "GPIO_B_8_15", "GPIO_B_16_23", "GPIO_B_24_31",
        "GDMA0 Channel0", "GDMA0 Channel1", "GDMA0 Channel2", "GDMA0 Channel3", "GDMA0 Channel4",
        "GDMA0 Channel5", "GDMA0 Channel6", "GDMA0 Channel7", "GDMA0 Channel8", "GDMA0 Channel9",
        "PPE", "I2C0", "I2C1", "I2C2", "I2C3", "UART0", "UART1", "UART2", "UART3", "UART4", "UART5",
        "SPI_3Wire", "SPI0", "SPI1", "SPI_Slave", "TIM0", "TIM1", "TIM2", "TIM3", "TIM4", "TIM5", "TIM6", "TIM7",
        "E_TIM0", "E_TIM1", "E_TIM2", "E_TIM3", "ADC_24bit", "SAR_ADC", "Keyscan", "AON_QDEC", "IR",
        "SDHC0", "ISO7816", "Display", "SPORT0 RX", "SPORT0 TX", "SPORT1 RX", "SPORT1 TX", "SHA256",
        "Pub Key Engine", "Flash SEC", "SegCom_CTL", "CAN", "ETH", "IMDC", "Slave_Port_Monitor", "PTA_Mailbox",
        "USB", "USB_Suspend_N", "USB_Endp_Multi_Proc", "USB_IN_EP_0", "USB_IN_EP_1", "USB_IN_EP_2", "USB_IN_EP_3",
        "USB_IN_EP_4", "USB_IN_EP_5", "USB_OUT_EP_0", "USB_OUT_EP_1", "USB_OUT_EP_2", "USB_OUT_EP_3", "USB_OUT_EP_4",
        "USB_OUT_EP_5", "USB_Sof", "Timer_A0_A1", "BT_Bluewiz", "BTMAC rsvd0", "Proprietary_protocol", "BTMAC rsvd1",
        "SPIC0", "SPIC1", "SPIC2", "TRNG", "LPCOMP", "SPI PHY1",  "Peri rsvd",
        "GPIOA2",  "GPIOA3",  "GPIOA4",  "GPIOA5",  "GPIOA6",  "GPIOA7",
        "GPIOA8",  "GPIOA9",  "GPIOA10", "GPIOA11", "GPIOA12", "GPIOA13", "GPIOA14", "GPIOA15",
        "GPIOA16", "GPIOA17", "GPIOA18", "GPIOA19", "GPIOA20", "GPIOA21", "GPIOA22", "GPIOA23",
        "GPIOA24", "GPIOA25", "GPIOA26", "GPIOA27", "GPIOA28", "GPIOA29", "GPIOA30", "GPIOA31",
        "GPIOB0",  "GPIOB1",  "GPIOB2",  "GPIOB3",  "GPIOB4",  "GPIOB5",  "GPIOB6",  "GPIOB7",
        "GPIOB8",  "GPIOB9",  "GPIOB10", "GPIOB11", "GPIOB12", "GPIOB13", "GPIOB14", "GPIOB15",
        "GPIOB16", "GPIOB17", "GPIOB18", "GPIOB19", "GPIOB20", "GPIOB21", "GPIOB22", "GPIOB23",
        "GPIOB24", "GPIOB25", "GPIOB26", "GPIOB27", "GPIOB28", "GPIOB29", "GPIOB30", "GPIOB31",
    };
#if defined ( __ARMCC_VERSION )
#if (FEATURE_TRUSTZONE_ENABLE == 1)
    IRQ_Fun *pRamVector    = (IRQ_Fun *)NS_RAM_VECTOR_ADDR;
#else
    IRQ_Fun *pRamVector    = (IRQ_Fun *)S_RAM_VECTOR_ADDR;
#endif
    IRQ_Fun *pAppVector    = (IRQ_Fun *)&Load$$RAM_VECTOR_TABLE$$RO$$Base;
    uint32_t AppVectorSize = (uint32_t)&Image$$RAM_VECTOR_TABLE$$RO$$Length;
#elif defined (__GNUC__)
    IRQ_Fun *pRamVector    = (IRQ_Fun *)(&__ram_vector_exe_ad__);
    IRQ_Fun *pAppVector    = (IRQ_Fun *)(&__ram_vector_load_ad__);
    uint32_t AppVectorSize = (uint32_t)&__ram_vector_table_length__;
#endif
    uint32_t i = 0;

#if (BOOT_DIRECT_DEBUG == 1)
    DBG_DIRECT("SCB->VTOR=0x%x, RAM VTOR=0x%x, APP LOAD VTOR=0x%x, size=0x%x", SCB->VTOR, pRamVector,
               pAppVector, AppVectorSize);
    DBG_DIRECT("Rom default ISR 0x%x, APP Default ISR 0x%x", Default_Handler_rom, Default_Handler);
#endif

#if (FEATURE_TRUSTZONE_ENABLE == 1)
    //if(OTP->trustzone_enable)
    if (SCB->VTOR != NS_RAM_VECTOR_ADDR)   //VTOR_RAM_ADDR is ns rom vector addr
    {
        RamVectorTableInit(NS_RAM_VECTOR_ADDR);
    }
#else
    if (SCB->VTOR != S_RAM_VECTOR_ADDR)   //VTOR_RAM_ADDR is ns rom vector addr
    {
        RamVectorTableInit(S_RAM_VECTOR_ADDR);
    }
#endif


    /* Update APP defined handlers */
    for (i = 0; i < AppVectorSize / 4; ++i)
    {
        if (i == 0 || i == 1) //skip __initial_sp and reset_handler remap
        {
            continue;
        }

        //DBG_DIRECT("before update: IPSR %d, app 0x%x, raw vector 0x%x", i, pAppVector[i], pRamVector[i]);

        if (((pAppVector[i] != Default_Handler) && (pAppVector[i] != 0)) ||
            ((pAppVector[i] == Default_Handler) &&
             (pRamVector[i] == Default_Handler_rom)))  //rom default handler
        {
#if (BOOT_DIRECT_DEBUG == 1)
            if (i < System_VECTORn)
            {
                DBG_DIRECT("Warning! %s is updated by APP!", SysException[i]);
            }
            else
            {
                DBG_DIRECT("Warning! ISR %s is updated by APP!", ExtIrq[i - System_VECTORn]);
            }
#else
            if (i < System_VECTORn)
            {
                BOOT_PRINT_WARN1("Warning! %s is updated by APP!", TRACE_STRING(SysException[i]));
            }
            else
            {
                BOOT_PRINT_WARN1("Warning! ISR %s is updated by APP!",
                                 TRACE_STRING(ExtIrq[i - System_VECTORn]));
            }
#endif

            RamVectorTableUpdate_ext((VECTORn_Type)i, (IRQ_Fun)pAppVector[i]);
        }

    }

    __DMB();
    __DSB();
}

uint32_t reset_reason_print(void) APP_FLASH_TEXT_SECTION;
uint32_t reset_reason_print(void)
{
    uint32_t result = 0;

    AON_NS_REG0X_APP_TYPE aon_0x1ae0 = {.d32 = AON_REG_READ(AON_NS_REG0X_APP)};
    sw_reset_reason = aon_0x1ae0.reset_reason;
    aon_0x1ae0.reset_reason = RESET_REASON_HW;
    AON_REG_WRITE(AON_NS_REG0X_APP, aon_0x1ae0.d32);

    AON_NS_REG_KM4_WDT_MODE_TYPE wdg_reset_flag;
    wdg_reset_flag.d32 = AON_REG_READ(AON_NS_REG_KM4_WDT_MODE);

