rtkconnectivity/rtl87x2g_sdk/bsp/boot/rtl87x2g/system_rtl.c
    //cpu_sleep_en config
#ifdef CPU_SLEEP_EN
    //define CPU_SLEEP_EN in otp_config.h
    OTP->cpu_sleep_en = CPU_SLEEP_EN;
#endif

    //os tick time config
#ifdef OS_TICK_TIME
    //define OS_TICK_TIME in otp_config.h
    set_os_clock(OS_TICK_TIME);
#endif

    //ftl config
#ifdef USE_FTL
    //define USE_FTL in otp_config.h
    OTP->use_ftl = USE_FTL;
#endif

    // swd pinmux config
#ifdef SWD_PINMUX_ENABLE
    //define SWD_PINMUX_ENABLE in otp_config.h
#if (SWD_PINMUX_ENABLE == 0)
    swd_pin_disable();
#endif
#endif

    //add multi-OS support
#if (MULT_OS == USE_FREERTOS)
    extern void os_freertos_patch_init(void);
    os_patch_init = os_freertos_patch_init;
#elif (MULT_OS == USE_RTT)   // RT-Thread OS
    extern void os_rtt_patch_init(void);
    os_patch_init = os_rtt_patch_init;
#endif

    //heap_ext_data_sram_mask_en config
#ifdef HEAP_EXT_DATA_SRAM_MASK_EN
    //define HEAP_EXT_DATA_SRAM_MASK_EN in otp_config.h
    OTP->heap_mask.heap_ext_data_sram_mask = HEAP_EXT_DATA_SRAM_MASK_EN;
#endif

    //log_ram_size config
#ifdef LOG_RAM_SIZE
    //define LOG_RAM_SIZE in otp_config.h
    OTP->log_ram_size = LOG_RAM_SIZE;
#endif

    return true;
}

void Peripheral_Handler(void) APP_RAM_TEXT_SECTION;
void Peripheral_Handler(void)
{
    //DBG_DIRECT("Peri_Handler");
    IRQ_Fun *Vectors = (IRQ_Fun *)SCB->VTOR;

    uint32_t peripheral_interrupt_status = SoC_VENDOR->u_004.REG_LOW_PRI_INT_STATUS;
    uint32_t real_interrupt_status = peripheral_interrupt_status &
                                     (SoC_VENDOR->u_00C.REG_LOW_PRI_INT_EN);

    while (real_interrupt_status)
    {
        uint8_t idx = 31 - __builtin_clz(real_interrupt_status);
        Vectors[Peripheral_First_VECTORn + idx]();
        real_interrupt_status &= ~BIT(idx);
    }

    //Clear sub-rout IRQ
    HAL_WRITE32(SOC_VENDOR_REG_BASE, 0x4, peripheral_interrupt_status);
}

void GPIOA_Handler(uint32_t mask) APP_RAM_TEXT_SECTION;
void GPIOA_Handler(uint32_t mask)
{
    IRQ_Fun *Vectors = (IRQ_Fun *)SCB->VTOR;
    uint32_t real_interrupt_status = GPIOA->GPIO_INT_STS & mask ;
    while (real_interrupt_status)
    {
        uint8_t idx = 31 - __builtin_clz(real_interrupt_status);
        Vectors[GPIOA2_VECTORn + idx - 2]();
        real_interrupt_status &= ~BIT(idx);
    }
}

void GPIO_A_2_7_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_A_2_7_Handler(void)
{
    GPIOA_Handler(0xFC);
}

void GPIO_A_8_15_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_A_8_15_Handler(void)
{
    GPIOA_Handler(0xFF00);
}

void GPIO_A_16_23_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_A_16_23_Handler(void)
{
    GPIOA_Handler(0xFF0000);
}

void GPIO_A_24_31_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_A_24_31_Handler(void)
{
    GPIOA_Handler(0xFF000000);
}

void GPIOB_Handler(uint32_t mask) APP_RAM_TEXT_SECTION;
void GPIOB_Handler(uint32_t mask)
{
    IRQ_Fun *Vectors = (IRQ_Fun *)SCB->VTOR;
    uint32_t real_interrupt_status = GPIOB->GPIO_INT_STS & mask ;
    while (real_interrupt_status)
    {
        uint8_t idx = 31 - __builtin_clz(real_interrupt_status);
        Vectors[GPIOB0_VECTORn + idx]();
        real_interrupt_status &= ~BIT(idx);
    }
}

void GPIO_B_0_7_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_B_0_7_Handler(void)
{
    GPIOB_Handler(0xFF);
}

void GPIO_B_8_15_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_B_8_15_Handler(void)
{
    GPIOB_Handler(0xFF00);
}

void GPIO_B_16_23_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_B_16_23_Handler(void)
{
    GPIOB_Handler(0xFF0000);
}

void GPIO_B_24_31_Handler(void) APP_RAM_TEXT_SECTION;
void GPIO_B_24_31_Handler(void)
{
    GPIOB_Handler(0xFF000000);
}


/*retarget to weak function to ensure that the application has freedom of redefinition*/
__WEAK void *malloc(size_t size)
{
    return os_mem_alloc(RAM_TYPE_DATA_ON, size);
}

__WEAK void *calloc(size_t n, size_t size)
{
    return os_mem_zalloc(RAM_TYPE_DATA_ON, n * size);
}

/*only for FreeRTOS*/
__WEAK void *realloc(void *ptr, size_t size)
{
    void *new_ptr;
    BlockLink_t *pxLink;
    size_t old_size, new_size = 0;

    if (ptr == NULL)
    {
        return os_mem_alloc(RAM_TYPE_DATA_ON, size);
    }

    if (size == 0)
    {
        os_mem_free(ptr);
        ptr = NULL;
        return NULL;
    }

    pxLink = (BlockLink_t *)((uint8_t *)ptr - sizeof(BlockLink_t));
    old_size = pxLink->xBlockSize;

    if ((old_size - sizeof(BlockLink_t)) ==
        (size + (FreeRTOS_portBYTE_ALIGNMENT - (size & (FreeRTOS_portBYTE_ALIGNMENT - 1)))))
    {
        return ptr;
    }

    os_sched_suspend();
    os_mem_free(ptr);
    new_ptr = os_mem_alloc(RAM_TYPE_DATA_ON, size);
    if (ptr != new_ptr)
    {
        pxLink = (BlockLink_t *)((uint8_t *)new_ptr - sizeof(BlockLink_t));
        new_size = pxLink->xBlockSize;
        memcpy(new_ptr, ptr, (old_size < new_size) ? (old_size - sizeof(BlockLink_t)) : (new_size - sizeof(
                    BlockLink_t)));
    }
    os_sched_resume();

    return new_ptr;
}

__WEAK void free(void *ptr)
{
    os_mem_free(ptr);
}

#if defined ( __ARMCC_VERSION   )
#elif defined ( __GNUC__   )
extern void *__aeabi_memset(void *s, size_t n, int c);
void *memset(void *s, int c, size_t n)
{
    return  __aeabi_memset(s, n, c);
}
#endif

#if defined ( __ARMCC_VERSION   )
#elif defined ( __GNUC__   )
#include <sys/stat.h>
#include <errno.h>
#undef errno
extern int errno;

int __attribute__((weak)) _close(int file)
{
    return -1;
}

int __attribute__((weak)) _fstat(int file, struct stat *st)
{
    st->st_mode = S_IFCHR;
    return 0;
}

int __attribute__((weak)) _getpid(void)
{
    return 1;
}

int __attribute__((weak)) _isatty(int file)
{
    return 1;
}

int __attribute__((weak)) _kill(int pid, int sig)
{
    errno = EINVAL;
    return -1;
}

int __attribute__((weak)) _lseek(int file, int ptr, int dir)
{
    return 0;
}

int __attribute__((weak)) _read(int file, char *ptr, int len)
{
    return 0;
}

int __attribute__((weak)) _write(int file, char *ptr, int len)
{
    return len;
}
#endif
